feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
#include "motor_test.h"

#include <Arduino.h>
#include <SimpleFOC.h>

#include "config.h"
#include "configurable_hall_sensor.h"

extern "C" {
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_spi.h"
}

namespace motor_test {

namespace {

float rpmToRadPerSec(float rpm) {
  return rpm * 0.104719755f;
}

uint16_t readU16Be(const uint8_t* data) {
  return static_cast<uint16_t>((static_cast<uint16_t>(data[0]) << 8) | data[1]);
}

struct DrvRegisters {
  uint16_t status1 = 0;
  uint16_t status2 = 0;
  uint16_t control1 = 0;
  uint16_t control2 = 0;
  bool frame_fault = false;
  bool spi_ok = false;
  bool control_match = false;
};

SPI_HandleTypeDef g_hspi1 = {};
DrvRegisters g_drv = {};
BLDCMotor g_motor(config::kConfiguredPolePairs);
BLDCDriver3PWM g_driver3(config::kPwmAPin, config::kPwmBPin, config::kPwmCPin);
BLDCDriver6PWM g_driver6(config::kPwmAPin, config::kPwmALowPin, config::kPwmBPin,
                         config::kPwmBLowPin, config::kPwmCPin, config::kPwmCLowPin);
ConfigurableHallSensor g_hall_sensor(config::kHallAPin, config::kHallBPin, config::kHallCPin,
                                     config::kConfiguredPolePairs,
                                     config::kSimpleFocClosedloopHallSectorOffset);

struct StepPattern {
  uint8_t pwm_a;
  uint8_t pwm_b;
  uint8_t pwm_c;
  const char* label;
};

constexpr StepPattern kForwardSteps[6] = {
    {config::kSixStepPwmDuty, 0, 0, "A+"},
    {config::kSixStepPwmDuty, config::kSixStepPwmDuty, 0, "A+B+"},
    {0, config::kSixStepPwmDuty, 0, "B+"},
    {0, config::kSixStepPwmDuty, config::kSixStepPwmDuty, "B+C+"},
    {0, 0, config::kSixStepPwmDuty, "C+"},
    {config::kSixStepPwmDuty, 0, config::kSixStepPwmDuty, "A+C+"},
};

constexpr uint8_t kRaw3PwmPinsDuty = 128;
constexpr uint8_t kHallSequence[6] = {0b001, 0b101, 0b100, 0b110, 0b010, 0b011};
constexpr uint8_t kDrvRegStatus1 = 0x00u;
constexpr uint8_t kDrvRegStatus2 = 0x01u;
constexpr uint8_t kDrvRegControl1 = 0x02u;
constexpr uint8_t kDrvRegControl2 = 0x03u;

enum Drv8301Control1Bits : uint16_t {
  kCtrl1GateCurrentShift = 0,
  kCtrl1GateResetBit = 2,
  kCtrl1PwmModeBit = 3,
  kCtrl1OcpModeShift = 4,
  kCtrl1OcAdjShift = 6,
};

enum Drv8301Control2Bits : uint16_t {
  kCtrl2OcToffBit = 0,
  kCtrl2DcCalCh2Bit = 1,
  kCtrl2DcCalCh1Bit = 2,
  kCtrl2GainShift = 3,
  kCtrl2OctwModeShift = 5,
};

bool g_driver_enabled = false;
bool g_drv_configured = false;
bool g_fault_latched = false;
bool g_openloop_started = false;
bool g_openloop_debug_started = false;
bool g_closedloop_started = false;
bool g_closedloop_startup_active = false;
bool g_drv_spi_stage_pwm = false;
bool g_sixstep_startup_active = false;
uint8_t g_step_index = 0;
uint8_t g_last_hall_state = 0xFF;
uint32_t g_boot_ms = 0;
uint32_t g_last_print_ms = 0;
uint32_t g_last_phase_change_ms = 0;
uint32_t g_sixstep_enable_ms = 0;
uint32_t g_sixstep_last_kick_ms = 0;
uint32_t g_closedloop_enable_ms = 0;
uint32_t g_closedloop_last_hall_transition_ms = 0;
uint32_t g_openloop_enable_ms = 0;
uint32_t g_openloop_last_good_drv_ms = 0;
uint32_t g_openloop_move_last_us = 0;
uint32_t g_openloop_move_interval_sum_us = 0;
uint32_t g_openloop_move_interval_max_us = 0;
uint32_t g_openloop_move_count = 0;
uint32_t g_openloop_move_duration_max_us = 0;
uint32_t g_openloop_debug_step_ms = 0;
uint32_t g_openloop_step_interval_ms = 0;
float g_openloop_debug_angle_el = 0.0f;
float g_openloop_debug_voltage = 0.0f;
float g_openloop_target_rad_s = 0.0f;
bool g_openloop_move_called = false;
uint8_t g_sixstep_current_duty = config::kSixStepPwmDuty;
bool g_closedloop_loopfoc_called = false;
bool g_closedloop_move_called = false;
bool g_closedloop_initfoc_started = false;
bool g_closedloop_initfoc_done = false;
bool g_closedloop_handoff_allowed = false;
bool g_closedloop_handoff_evaluated = false;
bool g_closedloop_hall_watchdog_tripped = false;
bool g_closedloop_safety_stop_latched = false;
float g_closedloop_startup_target_rad_s = 0.0f;
float g_closedloop_measured_rad_s_at_handoff = 0.0f;
uint32_t g_closedloop_startup_phase_ms = 0;
uint32_t g_closedloop_stall_since_ms = 0;
bool g_closedloop_recovery_active = false;
uint32_t g_closedloop_recovery_count = 0;
uint32_t g_closedloop_startup_forward_events = 0;
uint32_t g_closedloop_startup_reverse_events = 0;
uint32_t g_closedloop_startup_jump_events = 0;
int32_t g_closedloop_hall_forward_count = 0;
int32_t g_closedloop_hall_reverse_count = 0;
int32_t g_closedloop_hall_jump_count = 0;
int32_t g_closedloop_hall_invalid_count = 0;
int8_t g_closedloop_last_hall_idx = -1;
int8_t g_closedloop_hall_delta = 0;
volatile uint32_t hall_a_irq_count = 0;
volatile uint32_t hall_b_irq_count = 0;
volatile uint32_t hall_c_irq_count = 0;
uint32_t g_last_hall_a_irq_count = 0;
uint32_t g_last_hall_b_irq_count = 0;
uint32_t g_last_hall_c_irq_count = 0;
uint32_t g_hall_a_irq_delta = 0;
uint32_t g_hall_b_irq_delta = 0;
uint32_t g_hall_c_irq_delta = 0;
float g_last_sensor_angle = 0.0f;
float g_last_sensor_velocity = 0.0f;
bool g_sensor_angle_changes = false;
bool g_sensor_velocity_valid = false;
bool g_hall_irq_counts_increasing = false;
int32_t g_closedloop_stall_sector_counts[6] = {0, 0, 0, 0, 0, 0};
int8_t g_closedloop_last_stall_sector = -1;
float g_closedloop_last_stall_measured_rad_s = 0.0f;
float g_closedloop_last_stall_raw_sensor_rad_s = 0.0f;
bool g_closedloop_stall_detected = false;
bool g_closedloop_raw_zero_detected = false;

void printState(Stream& serial, const char* reason);
bool isValidHallState(uint8_t hall);
int8_t hallIndex(uint8_t hall);

bool isClosedloop6PwmMode() {
  return config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP_6PWM;
}

bool isPhaseCheck6PwmMode() {
  return config::kTestMode == config::TEST_PHASE_CHECK_6PWM;
}

bool isRawCPinsMode() {
  return config::kTestMode == config::TEST_RAW_C_PINS;
}

bool isPhaseCheck3PwmMode() {
  return config::kTestMode == config::TEST_PHASE_CHECK_3PWM;
}

bool isRaw3PwmPinsMode() {
  return config::kTestMode == config::TEST_RAW_3PWM_PINS;
}

bool isOpenloop6PwmMode() {
  return config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP;
}

bool uses6PwmDriverMode() {
  return isOpenloop6PwmMode() || isClosedloop6PwmMode() || isPhaseCheck6PwmMode();
}

bool usesSimpleFoc6PwmTimerMode() {
  return isOpenloop6PwmMode() || isClosedloop6PwmMode();
}

const char* closedloopDriverType() {
  return isClosedloop6PwmMode() ? "BLDCDriver6PWM" : "BLDCDriver3PWM";
}

float closedloopMeasuredRadS() {
  return g_motor.shaft_velocity;
}

float closedloopRawSensorRadS() {
  return g_hall_sensor.getVelocity();
}

float openloopDriverVoltageLimit() {
  return isOpenloop6PwmMode() ? g_driver6.voltage_limit : g_driver3.voltage_limit;
}

uint32_t tim1EstimatedPwmHz() {
#ifdef TIM1
  const uint32_t prescaler = TIM1->PSC + 1u;
  const uint32_t period = TIM1->ARR + 1u;
  if (prescaler == 0u || period == 0u) {
    return 0u;
  }
  const bool center_aligned = (TIM1->CR1 & TIM_CR1_CMS) != 0u;
  const uint32_t divisor = center_aligned ? 2u : 1u;
  return SystemCoreClock / prescaler / period / divisor;
#else
  return 0u;
#endif
}

uint32_t openloopMoveAvgIntervalUs() {
  return g_openloop_move_count == 0u ? 0u
                                     : (g_openloop_move_interval_sum_us / g_openloop_move_count);
}

void resetOpenloopMoveStats() {
  g_openloop_move_interval_sum_us = 0u;
  g_openloop_move_interval_max_us = 0u;
  g_openloop_move_count = 0u;
  g_openloop_move_duration_max_us = 0u;
}

