feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
int8_t closedloopHallSectorOffset() {
  return g_hall_sensor.getSectorOffset();
}

float closedloopTargetRadS() {
  return rpmToRadPerSec(config::kSimpleFocClosedloopTargetRpm) *
         (config::kSimpleFocClosedloopReverse ? -1.0f : 1.0f);
}

void recordClosedloopHallTransition(uint8_t prev_hall, uint8_t next_hall) {
  const int8_t prev_idx = hallIndex(prev_hall);
  const int8_t next_idx = hallIndex(next_hall);
  g_closedloop_last_hall_idx = next_idx;
  g_closedloop_last_hall_transition_ms = millis();

  if (!isValidHallState(next_hall) || prev_idx < 0 || next_idx < 0) {
    ++g_closedloop_hall_invalid_count;
    g_closedloop_hall_delta = 0;
    return;
  }

  const int8_t forward_delta = static_cast<int8_t>((next_idx - prev_idx + 6) % 6);
  if (forward_delta == 1) {
    ++g_closedloop_hall_forward_count;
    ++g_closedloop_startup_forward_events;
    g_closedloop_hall_delta = 1;
  } else if (forward_delta == 5) {
    ++g_closedloop_hall_reverse_count;
    ++g_closedloop_startup_reverse_events;
    g_closedloop_hall_delta = -1;
  } else {
    ++g_closedloop_hall_jump_count;
    ++g_closedloop_startup_jump_events;
    g_closedloop_hall_delta = forward_delta;
  }
}

void resetClosedloopStallTracking() {
  for (int index = 0; index < 6; ++index) {
    g_closedloop_stall_sector_counts[index] = 0;
  }
  g_closedloop_last_stall_sector = -1;
  g_closedloop_last_stall_measured_rad_s = 0.0f;
  g_closedloop_last_stall_raw_sensor_rad_s = 0.0f;
  g_closedloop_stall_detected = false;
  g_closedloop_raw_zero_detected = false;
}

void updateClosedloopStallTracking(uint8_t hall, float target_rad_s, float measured_rad_s,
                                   float raw_sensor_rad_s) {
  const int8_t hall_idx = hallIndex(hall);
  const float stall_limit = fabsf(target_rad_s) * config::kSimpleFocClosedloopStallDetectRatio;
  g_closedloop_raw_zero_detected =
      fabsf(raw_sensor_rad_s) <= config::kSimpleFocClosedloopRawZeroEpsilon;
  g_closedloop_stall_detected = fabsf(measured_rad_s) < stall_limit;
  if (g_closedloop_stall_detected && hall_idx >= 0) {
    ++g_closedloop_stall_sector_counts[hall_idx];
    g_closedloop_last_stall_sector = hall_idx;
    g_closedloop_last_stall_measured_rad_s = measured_rad_s;
    g_closedloop_last_stall_raw_sensor_rad_s = raw_sensor_rad_s;
  }
}

void startClosedloopStartupPhase(uint32_t now, float target_rad_s, bool recovery_active) {
  g_closedloop_startup_active = true;
  g_closedloop_recovery_active = recovery_active;
  g_closedloop_startup_phase_ms = now;
  g_closedloop_handoff_allowed = false;
  g_closedloop_handoff_evaluated = false;
  g_closedloop_hall_watchdog_tripped = false;
  g_closedloop_measured_rad_s_at_handoff = 0.0f;
  g_closedloop_startup_forward_events = 0;
  g_closedloop_startup_reverse_events = 0;
  g_closedloop_startup_jump_events = 0;
  g_closedloop_startup_target_rad_s =
      rpmToRadPerSec(recovery_active ? config::kSimpleFocClosedloopRecoveryRpm
                                     : config::kSimpleFocClosedloopStartupRpm) *
      ((target_rad_s >= 0.0f) ? 1.0f : -1.0f);
  g_motor.controller = MotionControlType::velocity_openloop;
}

bool closedloopHandoffReady(float target_rad_s, float measured_rad_s, float raw_sensor_rad_s) {
  const float handoff_limit = fabsf(target_rad_s) * 1.5f;
  return fabsf(measured_rad_s) <= handoff_limit &&
         fabsf(raw_sensor_rad_s) >= config::kSimpleFocClosedloopHandoffMinRawSensorRadS &&
         g_closedloop_startup_forward_events >=
             config::kSimpleFocClosedloopHandoffMinForwardTransitions &&
         g_closedloop_startup_reverse_events == 0u && g_closedloop_startup_jump_events == 0u;
}

bool closedloopHallWatchdogExpired(uint32_t now) {
  if (!g_closedloop_started || g_closedloop_startup_active) {
    return false;
  }
  if (fabsf(closedloopTargetRadS()) < 0.001f) {
    return false;
  }
  return (now - g_closedloop_last_hall_transition_ms) >
         config::kSimpleFocClosedloopHallWatchdogMs;
}

void advanceOpenloopAngleStep() {
  g_openloop_debug_angle_el += config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  if (g_openloop_debug_angle_el >= _2PI) {
    g_openloop_debug_angle_el -= _2PI;
  }
}

uint32_t openloopStepIntervalMsForRpm(float rpm) {
  const float clamped_rpm = max(1.0f, rpm);
  const float step_rad = config::kSimpleFocOpenloopDebugStepDeg * DEG_TO_RAD;
  const float electrical_rad_per_sec =
      rpmToRadPerSec(clamped_rpm) * static_cast<float>(config::kConfiguredPolePairs);
  const float interval_ms = (step_rad / electrical_rad_per_sec) * 1000.0f;
  return static_cast<uint32_t>(max(20.0f, min(200.0f, interval_ms)));
}

bool faultActive() {
  return digitalRead(config::kDrvFaultPin) == LOW;
}

void doHallA() {
  ++hall_a_irq_count;
  g_hall_sensor.handleA();
}

void doHallB() {
  ++hall_b_irq_count;
  g_hall_sensor.handleB();
}

void doHallC() {
  ++hall_c_irq_count;
  g_hall_sensor.handleC();
}

uint16_t buildDrvControl1(bool gate_reset) {
  uint16_t value = 0;
  value |= static_cast<uint16_t>((config::kDrvGateCurrentCode & 0x03u) << kCtrl1GateCurrentShift);
  value |= static_cast<uint16_t>((config::kDrvOcpModeCode & 0x03u) << kCtrl1OcpModeShift);
  value |= static_cast<uint16_t>((config::kDrvOcpAdjustCode & 0x1Fu) << kCtrl1OcAdjShift);
  if (!uses6PwmDriverMode() && config::kDrvUse3PwmMode) {
    value |= static_cast<uint16_t>(1u << kCtrl1PwmModeBit);
  }
  if (gate_reset) {
    value |= static_cast<uint16_t>(1u << kCtrl1GateResetBit);
  }
  return value;
}

uint16_t buildDrvControl2() {
  uint16_t value = 0;
  if (config::kDrvOcToff) {
    value |= static_cast<uint16_t>(1u << kCtrl2OcToffBit);
  }
  if (config::kDrvDcCalCh2) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh2Bit);
  }
  if (config::kDrvDcCalCh1) {
    value |= static_cast<uint16_t>(1u << kCtrl2DcCalCh1Bit);
  }
  value |= static_cast<uint16_t>((config::kDrvShuntGainCode & 0x03u) << kCtrl2GainShift);
  value |= static_cast<uint16_t>((config::kDrvOctwModeCode & 0x03u) << kCtrl2OctwModeShift);
  return value;
}

