feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
uint8_t readHallState() {
  const uint8_t a = static_cast<uint8_t>(digitalRead(config::kHallAPin) == HIGH);
  const uint8_t b = static_cast<uint8_t>(digitalRead(config::kHallBPin) == HIGH);
  const uint8_t c = static_cast<uint8_t>(digitalRead(config::kHallCPin) == HIGH);
  return static_cast<uint8_t>((a << 2) | (b << 1) | c);
}

const StepPattern& activePattern() {
  return kForwardSteps[g_step_index % 6u];
}

void applyPatternRaw(const StepPattern& pattern) {
  analogWrite(config::kPwmAPin, pattern.pwm_a);
  analogWrite(config::kPwmBPin, pattern.pwm_b);
  analogWrite(config::kPwmCPin, pattern.pwm_c);
  analogWrite(config::kPwmALowPin, 0);
  analogWrite(config::kPwmBLowPin, 0);
  analogWrite(config::kPwmCLowPin, 0);
}

void pwmOffRaw() {
  analogWrite(config::kPwmAPin, 0);
  analogWrite(config::kPwmBPin, 0);
  analogWrite(config::kPwmCPin, 0);
  analogWrite(config::kPwmALowPin, 0);
  analogWrite(config::kPwmBLowPin, 0);
  analogWrite(config::kPwmCLowPin, 0);
}

void pwmOff() {
  pwmOffRaw();
}

void drvDisable() {
  if (usesSimpleFoc6PwmTimerMode()) {
    g_driver6.disable();
  } else {
    pwmOffRaw();
  }
  digitalWrite(config::kDrvEnablePin, LOW);
  g_driver_enabled = false;
  g_drv_configured = false;
}

bool drvStatus2GvddOv() {
  return (g_drv.status2 & 0x80u) != 0u;
}

uint8_t drvStatus2DeviceId() {
  return static_cast<uint8_t>(g_drv.status2 & 0x0Fu);
}

bool drvReadyForPwm() {
  return g_driver_enabled && g_drv_configured && g_drv.control_match && !g_drv.frame_fault &&
         !faultActive() && g_drv.status1 == 0u && !drvStatus2GvddOv();
}

bool openloopDrvReadyForPwm(uint32_t now) {
  if (faultActive() || !g_driver_enabled || !g_openloop_started) {
    return false;
  }

  if (drvReadyForPwm()) {
    g_openloop_last_good_drv_ms = now;
    return true;
  }

  if (!g_drv_configured || !g_drv.spi_ok || g_drv.status1 != 0u || drvStatus2GvddOv()) {
    return false;
  }

  return (now - g_openloop_last_good_drv_ms) <= config::kSimpleFocOpenloopDrvReadbackDebounceMs;
}

bool applyPattern(const StepPattern& pattern) {
  if (!drvReadyForPwm()) {
    pwmOffRaw();
    return false;
  }
  applyPatternRaw(pattern);
  return true;
}

void applyStepIndexWithDuty(uint8_t step_index, uint8_t duty) {
  g_step_index = static_cast<uint8_t>(step_index % 6u);
  const StepPattern& base = activePattern();
  g_sixstep_current_duty = duty;
  if (!drvReadyForPwm()) {
    pwmOffRaw();
    return;
  }
  analogWrite(config::kPwmAPin, base.pwm_a ? duty : 0);
  analogWrite(config::kPwmBPin, base.pwm_b ? duty : 0);
  analogWrite(config::kPwmCPin, base.pwm_c ? duty : 0);
  analogWrite(config::kPwmALowPin, 0);
  analogWrite(config::kPwmBLowPin, 0);
  analogWrite(config::kPwmCLowPin, 0);
}

void applySinglePhase(uint8_t phase_index) {
  if (!drvReadyForPwm()) {
    pwmOffRaw();
    return;
  }
  analogWrite(config::kPwmAPin, phase_index == 0 ? config::kPhaseCheckPwmDuty : 0);
  analogWrite(config::kPwmBPin, phase_index == 1 ? config::kPhaseCheckPwmDuty : 0);
  analogWrite(config::kPwmCPin, phase_index == 2 ? config::kPhaseCheckPwmDuty : 0);
  analogWrite(config::kPwmALowPin, 0);
  analogWrite(config::kPwmBLowPin, 0);
  analogWrite(config::kPwmCLowPin, 0);
}

void applySinglePhaseStability(uint8_t phase_index) {
  if (!drvReadyForPwm()) {
    pwmOffRaw();
    return;
  }
  analogWrite(config::kPwmAPin, phase_index == 0 ? config::kDrvSpiStabilityPwmDuty : 0);
  analogWrite(config::kPwmBPin, phase_index == 1 ? config::kDrvSpiStabilityPwmDuty : 0);
  analogWrite(config::kPwmCPin, phase_index == 2 ? config::kDrvSpiStabilityPwmDuty : 0);
  analogWrite(config::kPwmALowPin, 0);
  analogWrite(config::kPwmBLowPin, 0);
  analogWrite(config::kPwmCLowPin, 0);
}

void applySingleLeg6Pwm(uint8_t leg_index) {
  if (!drvReadyForPwm()) {
    pwmOffRaw();
    return;
  }

  const bool high_side = (leg_index % 2u) == 0u;
  const uint8_t phase_index = leg_index / 2u;
  pwmOffRaw();

  if (high_side) {
    analogWrite(phase_index == 0u ? config::kPwmAPin
                                  : (phase_index == 1u ? config::kPwmBPin : config::kPwmCPin),
                config::kPhaseCheckPwmDuty);
  } else {
    analogWrite(phase_index == 0u ? config::kPwmALowPin
                                  : (phase_index == 1u ? config::kPwmBLowPin : config::kPwmCLowPin),
                config::kPhaseCheckPwmDuty);
  }
}

bool drvSpiGpioInit() {
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_SPI1_CLK_ENABLE();

  GPIO_InitTypeDef gpio = {};
  gpio.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  gpio.Mode = GPIO_MODE_AF_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  gpio.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &gpio);

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
  gpio.Pin = GPIO_PIN_4;
  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Pull = GPIO_NOPULL;
  gpio.Speed = GPIO_SPEED_FREQ_LOW;
  gpio.Alternate = 0;
  HAL_GPIO_Init(GPIOA, &gpio);
  return true;
}

bool drvSpiInit() {
  if (!drvSpiGpioInit()) {
    return false;
  }

  g_hspi1.Instance = SPI1;
  g_hspi1.Init.Mode = SPI_MODE_MASTER;
  g_hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  g_hspi1.Init.DataSize = SPI_DATASIZE_16BIT;
  g_hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  g_hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;
  g_hspi1.Init.NSS = SPI_NSS_SOFT;
  g_hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  g_hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  g_hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  g_hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  g_hspi1.Init.CRCPolynomial = 7;
  g_hspi1.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  g_hspi1.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;

  g_drv.spi_ok = (HAL_SPI_Init(&g_hspi1) == HAL_OK);
  return g_drv.spi_ok;
}

HAL_StatusTypeDef drvTransfer16(uint16_t tx_word, uint16_t* rx_word) {
  uint16_t tx_buf = tx_word;
  uint16_t rx_buf = 0;
  delayMicroseconds(2);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
  delayMicroseconds(2);
  const HAL_StatusTypeDef status =
      HAL_SPI_TransmitReceive(&g_hspi1, reinterpret_cast<uint8_t*>(&tx_buf),
                              reinterpret_cast<uint8_t*>(&rx_buf), 1u, 20u);
  delayMicroseconds(2);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
  delayMicroseconds(2);

  if (status == HAL_OK && rx_word != nullptr) {
    *rx_word = rx_buf;
  }
  return status;
}

HAL_StatusTypeDef drvReadRegister(uint8_t reg, uint16_t* value) {
  uint16_t rx_word = 0;
  const uint16_t cmd = static_cast<uint16_t>(0x8000u | ((static_cast<uint16_t>(reg) & 0x0Fu) << 11));
  HAL_StatusTypeDef status = drvTransfer16(cmd, &rx_word);
  if (status != HAL_OK) {
    g_drv.spi_ok = false;
    return status;
  }

  status = drvTransfer16(0u, &rx_word);
  if (status != HAL_OK) {
    g_drv.spi_ok = false;
    return status;
  }

