feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  g_drv.frame_fault = ((rx_word & 0x8000u) != 0u);

  if (value != nullptr) {
    *value = static_cast<uint16_t>(rx_word & 0x07FFu);
  }
  g_drv.spi_ok = true;
  return HAL_OK;
}

HAL_StatusTypeDef drvWriteRegister(uint8_t reg, uint16_t value) {
  uint16_t rx_word = 0;
  const uint16_t cmd =
      static_cast<uint16_t>(((static_cast<uint16_t>(reg) & 0x0Fu) << 11) | (value & 0x07FFu));
  const HAL_StatusTypeDef status = drvTransfer16(cmd, &rx_word);
  g_drv.spi_ok = (status == HAL_OK);
  return status;
}

bool drvReadAll() {
  if (!g_driver_enabled) {
    g_drv.spi_ok = false;
    g_drv.frame_fault = false;
    g_drv.control_match = false;
    return false;
  }
  bool ok = true;
  ok = (drvReadRegister(kDrvRegStatus1, &g_drv.status1) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegStatus2, &g_drv.status2) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegControl1, &g_drv.control1) == HAL_OK) && ok;
  ok = (drvReadRegister(kDrvRegControl2, &g_drv.control2) == HAL_OK) && ok;
  const uint16_t expected_ctrl1 = buildDrvControl1(false);
  const uint16_t expected_ctrl2 = buildDrvControl2();
  g_drv.control_match =
      (g_drv.control1 == expected_ctrl1) && (g_drv.control2 == expected_ctrl2);
  g_drv.spi_ok = ok;
  return ok;
}

bool drvConfigurePwmMode() {
  if (!g_driver_enabled) {
    g_drv_configured = false;
    return false;
  }
  const uint16_t expected_ctrl1 = buildDrvControl1(false);
  const uint16_t reset_ctrl1 = buildDrvControl1(true);
  const uint16_t expected_ctrl2 = buildDrvControl2();

  (void)drvWriteRegister(kDrvRegControl1, reset_ctrl1);
  delay(1);

  if (drvWriteRegister(kDrvRegControl1, expected_ctrl1) != HAL_OK) {
    return false;
  }
  if (drvWriteRegister(kDrvRegControl2, expected_ctrl2) != HAL_OK) {
    return false;
  }
  g_drv_configured = drvReadAll();
  return g_drv_configured;
}

bool drvEnableAndConfigure(Stream& serial) {
  if (usesSimpleFoc6PwmTimerMode()) {
    g_driver6.disable();
  } else {
    pwmOffRaw();
  }
  digitalWrite(config::kDrvEnablePin, HIGH);
  delay(50);
  g_driver_enabled = true;
  g_drv_configured = false;

  if (!drvConfigurePwmMode()) {
    printState(serial, "drv_config_failed");
    drvDisable();
    return false;
  }

  (void)drvReadAll();
  if (!faultActive() && !g_drv.frame_fault && g_drv.control_match && g_drv.status1 == 0u &&
      !drvStatus2GvddOv()) {
    g_driver_enabled = true;
    g_drv_configured = true;
    return true;
  }

  printState(serial, "drv_config_invalid");
  drvDisable();
  return false;
}

bool isValidHallState(uint8_t hall) {
  return hall != 0b000 && hall != 0b111;
}

int8_t hallIndex(uint8_t hall) {
  for (uint8_t index = 0; index < 6; ++index) {
    if (kHallSequence[index] == hall) {
      return static_cast<int8_t>(index);
    }
  }
  return -1;
}

void printHallBits(Stream& serial, uint8_t hall) {
  serial.print((hall >> 2) & 0x01);
  serial.print((hall >> 1) & 0x01);
  serial.print(hall & 0x01);
}

uint8_t commutationIndexFromHall(uint8_t hall) {
  const int8_t hall_index = hallIndex(hall);
  if (hall_index < 0) {
    return 0;
  }

  int8_t target_index = static_cast<int8_t>(hall_index + config::kSixStepHallAdvance);
  if (config::kSixStepReverseDirection) {
    target_index = static_cast<int8_t>(hall_index - config::kSixStepHallAdvance);
  }

  while (target_index < 0) {
    target_index += 6;
  }
  while (target_index >= 6) {
    target_index -= 6;
  }
  return static_cast<uint8_t>(target_index);
}

bool applyCommutationForHall(uint8_t hall) {
  if (!isValidHallState(hall)) {
    pwmOff();
    return false;
  }

  applyStepIndexWithDuty(commutationIndexFromHall(hall), config::kSixStepPwmDuty);
  return true;
}

void printDrvRegisters(Stream& serial) {
  const uint16_t expected_ctrl1 = buildDrvControl1(false);
  serial.print(" spi_ok=");
  serial.print(g_drv.spi_ok ? "yes" : "no");
  serial.print(" frame_fault=");
  serial.print(g_drv.frame_fault ? "yes" : "no");
  serial.print(" status1=0x");
  serial.print(g_drv.status1, HEX);
  serial.print(" status2_raw=0x");
  serial.print(g_drv.status2, HEX);
  serial.print(" status2_device_id=0x");
  serial.print(drvStatus2DeviceId(), HEX);
  serial.print(" status2_gvdd_ov=");
  serial.print(drvStatus2GvddOv() ? "yes" : "no");
  serial.print(" ctrl1=0x");
  serial.print(g_drv.control1, HEX);
  serial.print(" expected_ctrl1=0x");
  serial.print(expected_ctrl1, HEX);
  serial.print(" ctrl2=0x");
  serial.print(g_drv.control2, HEX);
  serial.print(" ctrl_match=");
  serial.print(g_drv.control_match ? "yes" : "no");
}

void printState(Stream& serial, const char* reason) {
  if (config::kTestMode == config::TEST_HALL_SENSOR_CHECK) {
    const uint8_t hall = readHallState();
    g_hall_sensor.update();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" raw_hall=");
    printHallBits(serial, hall);
    serial.print(" raw_valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" hall_idx=");
    serial.print(hallIndex(hall));
    serial.print(" sensor_angle=");
    serial.print(g_hall_sensor.getAngle(), 4);
    serial.print(" sensor_vel=");
    serial.print(g_hall_sensor.getVelocity(), 4);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_DRIVER_SPI_STABILITY) {
    const uint8_t hall = readHallState();
    static const char* kPhaseLabels[3] = {"A", "B", "C"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" stage=");
    serial.print(g_drv_spi_stage_pwm ? "pwm_stress" : "no_pwm");
    serial.print(" phase=");
    serial.print(kPhaseLabels[g_step_index % 3u]);
    serial.print(" pwm=");
    serial.print(g_drv_spi_stage_pwm ? config::kDrvSpiStabilityPwmDuty : 0);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP ||
      config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP_6PWM) {
    const uint8_t hall = readHallState();
    const float measured_rad_s = closedloopMeasuredRadS();
    const float raw_sensor_rad_s = closedloopRawSensorRadS();
    const float target_rad_s =
        g_closedloop_startup_active ? g_closedloop_startup_target_rad_s : closedloopTargetRadS();
    const float sensor_angle = g_hall_sensor.getAngle();
    const float sensor_velocity = g_hall_sensor.getVelocity();
    const float motor_shaft_angle = g_motor.shaft_angle;
    const float motor_shaft_velocity = g_motor.shaft_velocity;
    const uint32_t irq_a = hall_a_irq_count;
    const uint32_t irq_b = hall_b_irq_count;
    const uint32_t irq_c = hall_c_irq_count;
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" mode=");
    serial.print(g_closedloop_startup_active ? "startup" : "closed");
    serial.print(" pwm_mode=");
    serial.print(isClosedloop6PwmMode() ? "6PWM" : "3PWM");
    serial.print(" driver_type=");
    serial.print(closedloopDriverType());
    if (isClosedloop6PwmMode()) {
      serial.print(" high_pins=PA8,PA9,PA10");
      serial.print(" low_pins=PB13,PB14,PB1");
      serial.print(" dead_zone=");
      serial.print(config::kSimpleFocClosedloop6PwmDeadZone, 3);
    }
    serial.print(" target_rpm=");
    serial.print(config::kSimpleFocClosedloopTargetRpm, 1);
    serial.print(" target_rad_s=");
    serial.print(target_rad_s, 3);
    serial.print(" measured_rad_s=");
    serial.print(measured_rad_s, 3);
    serial.print(" raw_sensor_rad_s=");
    serial.print(raw_sensor_rad_s, 3);
    serial.print(" velocity_error=");
    serial.print(target_rad_s - measured_rad_s, 3);
    serial.print(" startup_target_rad_s=");
    serial.print(g_closedloop_startup_target_rad_s, 3);
    serial.print(" measured_rad_s_at_handoff=");
    serial.print(g_closedloop_measured_rad_s_at_handoff, 3);
    serial.print(" handoff_allowed=");
    serial.print(g_closedloop_handoff_allowed ? "yes" : "no");
    serial.print(" recovery_active=");
    serial.print(g_closedloop_recovery_active ? "yes" : "no");
    serial.print(" recovery_count=");
    serial.print(g_closedloop_recovery_count);
    serial.print(" startup_fwd=");
    serial.print(g_closedloop_startup_forward_events);
    serial.print(" startup_rev=");
    serial.print(g_closedloop_startup_reverse_events);
    serial.print(" startup_jump=");
    serial.print(g_closedloop_startup_jump_events);
    serial.print(" voltage_limit=");
    serial.print(g_motor.voltage_limit, 2);
    serial.print(" pid_p=");
    serial.print(g_motor.PID_velocity.P, 4);
    serial.print(" pid_i=");
    serial.print(g_motor.PID_velocity.I, 4);
    serial.print(" pid_d=");
    serial.print(g_motor.PID_velocity.D, 4);
    serial.print(" lpf_tf=");
    serial.print(g_motor.LPF_velocity.Tf, 3);
    serial.print(" output_ramp=");
    serial.print(g_motor.PID_velocity.output_ramp, 2);
    serial.print(" motion_downsample=");
    serial.print(g_motor.motion_downsample);
    serial.print(" hall_sector_offset=");
    serial.print(closedloopHallSectorOffset());
    serial.print(" closedloop_loopfoc_called=");
    serial.print(g_closedloop_loopfoc_called ? "yes" : "no");
    serial.print(" closedloop_move_called=");
    serial.print(g_closedloop_move_called ? "yes" : "no");
    serial.print(" initFOC_start=");
    serial.print(g_closedloop_initfoc_started ? "yes" : "no");
    serial.print(" initFOC_done=");
    serial.print(g_closedloop_initfoc_done ? "yes" : "no");
    serial.print(" shaft_vel=");
    serial.print(measured_rad_s, 3);
    serial.print(" shaft_angle=");
    serial.print(sensor_angle, 3);
    serial.print(" raw_hall=");
    printHallBits(serial, hall);
    serial.print(" raw_hall_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" hall_irq_a=");
    serial.print(irq_a);
    serial.print(" hall_irq_b=");
    serial.print(irq_b);
    serial.print(" hall_irq_c=");
    serial.print(irq_c);
    serial.print(" hall_irq_a_delta=");
    serial.print(g_hall_a_irq_delta);
    serial.print(" hall_irq_b_delta=");
    serial.print(g_hall_b_irq_delta);
    serial.print(" hall_irq_c_delta=");
    serial.print(g_hall_c_irq_delta);
    serial.print(" hall_irq_counts_increasing=");
    serial.print(g_hall_irq_counts_increasing ? "yes" : "no");
    serial.print(" sensor_angle=");
    serial.print(sensor_angle, 3);
    serial.print(" sensor_velocity=");
    serial.print(sensor_velocity, 3);
    serial.print(" sensor_angle_changes=");
    serial.print(g_sensor_angle_changes ? "yes" : "no");
    serial.print(" sensor_velocity_valid=");
    serial.print(g_sensor_velocity_valid ? "yes" : "no");
    serial.print(" motor_shaft_angle=");
    serial.print(motor_shaft_angle, 3);
    serial.print(" motor_shaft_velocity=");
    serial.print(motor_shaft_velocity, 3);
    serial.print(" drv_configured=");
    serial.print(g_drv_configured ? "yes" : "no");
    serial.print(" hall_fwd=");
    serial.print(g_closedloop_hall_forward_count);
    serial.print(" hall_rev=");
    serial.print(g_closedloop_hall_reverse_count);
    serial.print(" hall_jump=");
    serial.print(g_closedloop_hall_jump_count);
    serial.print(" hall_invalid=");
    serial.print(g_closedloop_hall_invalid_count);
    serial.print(" last_hall=");
    serial.print(g_closedloop_last_hall_idx);
    serial.print(" hall_delta=");
    serial.print(g_closedloop_hall_delta);
    serial.print(" stall_detected=");
    serial.print(g_closedloop_stall_detected ? "yes" : "no");
    serial.print(" raw_zero_detected=");
    serial.print(g_closedloop_raw_zero_detected ? "yes" : "no");
    serial.print(" last_stall_sector=");
    serial.print(g_closedloop_last_stall_sector);
    serial.print(" last_stall_measured_rad_s=");
    serial.print(g_closedloop_last_stall_measured_rad_s, 3);
    serial.print(" last_stall_raw_sensor_rad_s=");
    serial.print(g_closedloop_last_stall_raw_sensor_rad_s, 3);
    serial.print(" stall_s0=");
    serial.print(g_closedloop_stall_sector_counts[0]);
    serial.print(" stall_s1=");
    serial.print(g_closedloop_stall_sector_counts[1]);
    serial.print(" stall_s2=");
    serial.print(g_closedloop_stall_sector_counts[2]);
    serial.print(" stall_s3=");
    serial.print(g_closedloop_stall_sector_counts[3]);
    serial.print(" stall_s4=");
    serial.print(g_closedloop_stall_sector_counts[4]);
    serial.print(" stall_s5=");
    serial.print(g_closedloop_stall_sector_counts[5]);
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP_DEBUG) {
    const uint8_t hall = readHallState();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" dbg_voltage=");
    serial.print(g_openloop_debug_voltage, 2);
    serial.print(" angle_el=");
    serial.print(g_openloop_debug_angle_el, 3);
    serial.print(" step_deg=");
    serial.print(config::kSimpleFocOpenloopDebugStepDeg, 1);
    serial.print(" step_ms=");
    serial.print(config::kSimpleFocOpenloopDebugStepMs);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

