feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  if (config::kTestMode == config::TEST_PHASE_CHECK) {
    const uint8_t hall = readHallState();
    static const char* kPhaseLabels[3] = {"A", "B", "C"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" phase=");
    serial.print(kPhaseLabels[g_step_index % 3u]);
    serial.print(" pwm=");
    serial.print(config::kPhaseCheckPwmDuty);
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_3PWM) {
    const uint8_t hall = readHallState();
    static const char* kPhaseLabels[3] = {"A_high", "B_high", "C_high"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" phase=");
    serial.print(kPhaseLabels[g_step_index % 3u]);
    serial.print(" pwm=");
    serial.print(config::kPhaseCheckPwmDuty);
    serial.print(" pins=PA8,PA9,PA10");
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_6PWM) {
    const uint8_t hall = readHallState();
    static const char* kLegLabels[6] = {"A_high", "A_low", "B_high", "B_low", "C_high", "C_low"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" leg=");
    serial.print(kLegLabels[g_step_index % 6u]);
    serial.print(" pwm=");
    serial.print(config::kPhaseCheckPwmDuty);
    serial.print(" high_pins=PA8,PA9,PA10");
    serial.print(" low_pins=PB13,PB14,PB1");
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_RAW_C_PINS) {
    static const char* kRawPinLabels[2] = {"PA10_high", "PB1_low"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" raw_pin=");
    serial.print(kRawPinLabels[g_step_index % 2u]);
    serial.print(" pwm=");
    serial.print(config::kPhaseCheckPwmDuty);
    serial.print(" hold_ms=");
    serial.print(config::kPhaseCheckHoldMs);
    serial.print(" pa10=");
    serial.print((g_step_index % 2u) == 0u ? "active" : "off");
    serial.print(" pb1=");
    serial.print((g_step_index % 2u) == 1u ? "active" : "off");
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_RAW_3PWM_PINS) {
    static const char* kRawPinLabels[3] = {"PA8_A", "PA9_B", "PA10_C"};
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" raw_pin=");
    serial.print(kRawPinLabels[g_step_index % 3u]);
    serial.print(" pwm_freq_hz=20000 pwm=");
    serial.print(kRaw3PwmPinsDuty);
    serial.print(" hold_ms=");
    serial.print(config::kPhaseCheckHoldMs);
    serial.print(" pa8=");
    serial.print((g_step_index % 3u) == 0u ? "active" : "off");
    serial.print(" pa9=");
    serial.print((g_step_index % 3u) == 1u ? "active" : "off");
    serial.print(" pa10=");
    serial.print((g_step_index % 3u) == 2u ? "active" : "off");
    serial.println();
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP) {
    const uint8_t hall = readHallState();
    serial.print("motor_test reason=");
    serial.print(reason);
    serial.print(" en=");
    serial.print(g_driver_enabled ? "HIGH" : "LOW");
    serial.print(" fault=");
    serial.print(faultActive() ? "ACTIVE" : "inactive");
    serial.print(" target_rpm=");
    serial.print(config::kSimpleFocOpenloopTargetRpm, 1);
    serial.print(" target_rad_s=");
    serial.print(g_openloop_target_rad_s, 3);
  serial.print(" openloop_move_called=");
  serial.print(g_openloop_move_called ? "yes" : "no");
    serial.print(" motor.voltage_limit=");
    serial.print(g_motor.voltage_limit, 2);
    serial.print(" driver.voltage_limit=");
    serial.print(openloopDriverVoltageLimit(), 2);
    serial.print(" pwm_req_hz=");
    serial.print(g_driver6.pwm_frequency);
    serial.print(" tim1_est_pwm_hz=");
    serial.print(tim1EstimatedPwmHz());
#ifdef TIM1
    serial.print(" tim1_psc=");
    serial.print(TIM1->PSC);
    serial.print(" tim1_arr=");
    serial.print(TIM1->ARR);
    serial.print(" tim1_cr1=0x");
    serial.print(TIM1->CR1, HEX);
    serial.print(" tim1_bdtr=0x");
    serial.print(TIM1->BDTR, HEX);
#endif
    serial.print(" move_avg_us=");
    serial.print(openloopMoveAvgIntervalUs());
    serial.print(" move_max_us=");
    serial.print(g_openloop_move_interval_max_us);
    serial.print(" move_count=");
    serial.print(g_openloop_move_count);
    serial.print(" move_duration_max_us=");
    serial.print(g_openloop_move_duration_max_us);
    serial.print(" drv_configured=");
    serial.print(g_drv_configured ? "yes" : "no");
    serial.print(" hall=");
    printHallBits(serial, hall);
    serial.print(" hall_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    return;
  }

  const StepPattern& pattern = activePattern();
  const uint8_t hall = readHallState();
  serial.print("motor_test reason=");
  serial.print(reason);
  serial.print(" en=");
  serial.print(g_driver_enabled ? "HIGH" : "LOW");
  serial.print(" fault=");
  serial.print(faultActive() ? "ACTIVE" : "inactive");
  serial.print(" step=");
  serial.print(g_step_index % 6u);
  serial.print(" pattern=");
  serial.print(pattern.label);
  serial.print(" mode=");
  serial.print(g_sixstep_startup_active ? "startup_kick" : "hall_track");
  serial.print(" hall_idx=");
  serial.print(hallIndex(hall));
  serial.print(" pwm=[");
  serial.print(pattern.pwm_a ? g_sixstep_current_duty : 0);
  serial.print(",");
  serial.print(pattern.pwm_b ? g_sixstep_current_duty : 0);
  serial.print(",");
  serial.print(pattern.pwm_c ? g_sixstep_current_duty : 0);
  serial.print("] hall=");
  serial.print((hall >> 2) & 0x01);
  serial.print((hall >> 1) & 0x01);
  serial.print(hall & 0x01);
  serial.print(" valid=");
  serial.println(isValidHallState(hall) ? "yes" : "no");
}

