feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  g_last_hall_state = readHallState();
  g_last_print_ms = 0;

  g_hall_sensor.pullup = Pullup::USE_INTERN;
  g_hall_sensor.setSectorOffset(config::kSimpleFocClosedloopHallSectorOffset);
  g_hall_sensor.init();
  g_hall_sensor.enableInterrupts(doHallA, doHallB, doHallC);

  serial.println("HallSensor integration check");
  serial.println("Rotate motor by hand. Compare raw_hall and sensor angle/velocity.");
  printState(serial, "boot");
}

void beginPhaseCheck(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("Phase check test");
  serial.println("One phase at a time with low PWM.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Expect similar rotor holding feel on A, B and C.");
  printState(serial, "boot");
}

void beginDrvSpiStability(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_drv_spi_stage_pwm = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("DRV SPI stability test");
  serial.println("Stage 1: driver enabled, no PWM. Stage 2: low-PWM phase stress.");
  serial.print("Enable delay ms=");
  serial.print(config::kDrvSpiStabilityEnableDelayMs);
  serial.print(" no_pwm_ms=");
  serial.print(config::kDrvSpiStabilityNoPwmMs);
  serial.print(" step_ms=");
  serial.print(config::kDrvSpiStabilityStepMs);
  serial.print(" pwm=");
  serial.println(config::kDrvSpiStabilityPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  printState(serial, "boot");
}

void beginPhaseCheck6Pwm(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  pinMode(config::kPwmALowPin, OUTPUT);
  pinMode(config::kPwmBLowPin, OUTPUT);
  pinMode(config::kPwmCLowPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("6PWM phase leg check test");
  serial.println("One half-bridge output at a time with low PWM.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Sequence: A_high, A_low, B_high, B_low, C_high, C_low.");
  printState(serial, "boot");
}

void beginPhaseCheck3Pwm(Stream& serial) {
  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("3PWM phase check test");
  serial.println("One high-side PWM output at a time with low duty.");
  serial.print("Enable delay ms=");
  serial.print(config::kPhaseCheckEnableDelayMs);
  serial.print(" hold ms=");
  serial.print(config::kPhaseCheckHoldMs);
  serial.print(" pwm=");
  serial.println(config::kPhaseCheckPwmDuty);
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Sequence: A_high, B_high, C_high.");
  printState(serial, "boot");
}

void beginRawCPins(Stream& serial) {
  pinMode(config::kPwmCPin, OUTPUT);
  pinMode(config::kPwmCLowPin, OUTPUT);
  analogWrite(config::kPwmCPin, 0);
  analogWrite(config::kPwmCLowPin, 0);

  g_step_index = 0;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;

  serial.println("Raw C pins PWM test");
  serial.println("No DRV, no SimpleFOC. Direct MCU PWM only.");
  serial.print("pins=PA10,PB15 pwm=");
  serial.print(config::kPhaseCheckPwmDuty);
  serial.print(" hold_ms=");
  serial.println(config::kPhaseCheckHoldMs);
  serial.println("Sequence: PA10_high, then PB15_low.");
  printState(serial, "boot");
}

