feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
void beginRaw3PwmPins(Stream& serial) {
  analogWriteResolution(8);
  analogWriteFrequency(20000);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  analogWrite(config::kPwmAPin, 0);
  analogWrite(config::kPwmBPin, 0);
  analogWrite(config::kPwmCPin, 0);

  g_step_index = 0;
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_last_phase_change_ms = 0;

  serial.println("Raw 3PWM pins test");
  serial.println("No DRV, no SimpleFOC. Direct MCU PWM only.");
  serial.print("pins=PA8,PA9,PA10 pwm_freq_hz=20000 pwm=");
  serial.print(kRaw3PwmPinsDuty);
  serial.print(" hold_ms=");
  serial.println(config::kPhaseCheckHoldMs);
  serial.println("Sequence: PA8_A, PA9_B, PA10_C.");
  printState(serial, "boot");
}

void updatePhaseCheck(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySinglePhase(g_step_index % 3u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhase(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updatePhaseCheck6Pwm(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySingleLeg6Pwm(g_step_index % 6u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 6u);
    applySingleLeg6Pwm(g_step_index % 6u);
    g_last_phase_change_ms = now;
    printState(serial, "leg_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updateRawCPins(Stream& serial) {
  const uint32_t now = millis();

  if (g_last_phase_change_ms == 0u) {
    g_last_phase_change_ms = now;
    analogWrite(config::kPwmCPin, config::kPhaseCheckPwmDuty);
    analogWrite(config::kPwmCLowPin, 0);
    printState(serial, "enable_applied");
  }

  if ((now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 2u);
    if ((g_step_index % 2u) == 0u) {
      analogWrite(config::kPwmCPin, config::kPhaseCheckPwmDuty);
      analogWrite(config::kPwmCLowPin, 0);
    } else {
      analogWrite(config::kPwmCPin, 0);
      analogWrite(config::kPwmCLowPin, config::kPhaseCheckPwmDuty);
    }
    g_last_phase_change_ms = now;
    printState(serial, "pin_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    printState(serial, "periodic");
  }
}

void updatePhaseCheck3Pwm(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kPhaseCheckEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      applySinglePhase(g_step_index % 3u);
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

  if (g_driver_enabled && (now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhase(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    printState(serial, "periodic");
  }
}

void updateRaw3PwmPins(Stream& serial) {
  const uint32_t now = millis();

  if (g_last_phase_change_ms == 0u) {
    g_last_phase_change_ms = now;
    analogWrite(config::kPwmAPin, kRaw3PwmPinsDuty);
    analogWrite(config::kPwmBPin, 0);
    analogWrite(config::kPwmCPin, 0);
    printState(serial, "enable_applied");
  }

  if ((now - g_last_phase_change_ms) >= config::kPhaseCheckHoldMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    analogWrite(config::kPwmAPin, (g_step_index % 3u) == 0u ? kRaw3PwmPinsDuty : 0);
    analogWrite(config::kPwmBPin, (g_step_index % 3u) == 1u ? kRaw3PwmPinsDuty : 0);
    analogWrite(config::kPwmCPin, (g_step_index % 3u) == 2u ? kRaw3PwmPinsDuty : 0);
    g_last_phase_change_ms = now;
    printState(serial, "pin_advance");
  }

  if ((now - g_last_print_ms) >= config::kPhaseCheckStatusIntervalMs) {
    g_last_print_ms = now;
    printState(serial, "periodic");
  }
}

void updateDrvSpiStability(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint16_t prev_ctrl1 = g_drv.control1;
  const uint16_t prev_ctrl2 = g_drv.control2;
  const bool prev_match = g_drv.control_match;

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kDrvSpiStabilityEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_last_phase_change_ms = now;
    }
    printState(serial, drvReadyForPwm() ? "enable_applied" : "enable_failed");
  }

