feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  if (g_driver_enabled && !g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityNoPwmMs) {
    g_drv_spi_stage_pwm = true;
    g_step_index = 0;
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "pwm_stress_start");
  }

  if (g_driver_enabled && g_drv_spi_stage_pwm &&
      (now - g_last_phase_change_ms) >= config::kDrvSpiStabilityStepMs) {
    g_step_index = static_cast<uint8_t>((g_step_index + 1u) % 3u);
    applySinglePhaseStability(g_step_index % 3u);
    g_last_phase_change_ms = now;
    printState(serial, "phase_advance");
  }

  if ((now - g_last_print_ms) >= config::kDrvSpiStabilityStatusIntervalMs) {
    g_last_print_ms = now;
    (void)drvReadAll();
    if (g_drv.control1 != prev_ctrl1 || g_drv.control2 != prev_ctrl2 || g_drv.control_match != prev_match) {
      printState(serial, "reg_change");
    } else {
      printState(serial, "periodic");
    }
  }
}

void updateSimpleFocOpenloop(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver6.disable();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_openloop_started = false;
      g_openloop_enable_ms = 0;
      g_openloop_target_rad_s = 0.0f;
      g_openloop_move_called = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    g_openloop_move_called = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver6.enable();
      g_motor.enable();
      g_openloop_started = true;
      g_openloop_enable_ms = now;
      g_openloop_last_good_drv_ms = now;
      g_last_hall_state = hall;
    } else {
      g_openloop_started = false;
    }
    printState(serial, g_openloop_started ? "enable_applied" : "enable_failed");
  }

  g_openloop_target_rad_s = rpmToRadPerSec(config::kSimpleFocOpenloopTargetRpm);
  g_openloop_move_called = false;

  if (openloopDrvReadyForPwm(now)) {
    g_motor.voltage_limit = config::kSimpleFocOpenloopVoltageLimit;
    const uint32_t move_start_us = micros();
    if (g_openloop_move_last_us != 0u) {
      const uint32_t interval_us = move_start_us - g_openloop_move_last_us;
      g_openloop_move_interval_sum_us += interval_us;
      if (interval_us > g_openloop_move_interval_max_us) {
        g_openloop_move_interval_max_us = interval_us;
      }
      g_openloop_move_count++;
    }
    g_openloop_move_last_us = move_start_us;
    g_motor.move(g_openloop_target_rad_s);
    const uint32_t move_duration_us = micros() - move_start_us;
    if (move_duration_us > g_openloop_move_duration_max_us) {
      g_openloop_move_duration_max_us = move_duration_us;
    }
    g_openloop_move_called = true;
  } else {
    g_driver6.disable();
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    const uint32_t irq_a = hall_a_irq_count;
    const uint32_t irq_b = hall_b_irq_count;
    const uint32_t irq_c = hall_c_irq_count;
    const float sensor_angle = g_hall_sensor.getAngle();
    const float sensor_velocity = g_hall_sensor.getVelocity();
    g_hall_irq_counts_increasing =
        (irq_a > g_last_hall_a_irq_count) || (irq_b > g_last_hall_b_irq_count) ||
        (irq_c > g_last_hall_c_irq_count);
    g_sensor_angle_changes = fabsf(sensor_angle - g_last_sensor_angle) > 0.0001f;
    g_sensor_velocity_valid = isfinite(sensor_velocity) && fabsf(sensor_velocity) < 10000.0f;
    g_last_hall_a_irq_count = irq_a;
    g_last_hall_b_irq_count = irq_b;
    g_last_hall_c_irq_count = irq_c;
    g_last_sensor_angle = sensor_angle;
    g_last_sensor_velocity = sensor_velocity;
    g_last_print_ms = now;
    if (g_driver_enabled && config::kSimpleFocOpenloopPeriodicSpiRead) {
      (void)drvReadAll();
    }
    if (config::kSimpleFocOpenloopPeriodicLog) {
      printState(serial, "periodic");
    }
    resetOpenloopMoveStats();
  }

  if (config::kSimpleFocLogHallChanges && g_driver_enabled && hall != g_last_hall_state) {
    serial.print("motor_test reason=hall_change prev=");
    printHallBits(serial, g_last_hall_state);
    serial.print(" next=");
    printHallBits(serial, hall);
    serial.print(" prev_idx=");
    serial.print(hallIndex(g_last_hall_state));
    serial.print(" next_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" target_rad_s=");
    serial.print(g_openloop_target_rad_s, 3);
    serial.print(" openloop_move_called=");
    serial.print(g_openloop_move_called ? "yes" : "no");
    serial.print(" drv_configured=");
    serial.print(g_drv_configured ? "yes" : "no");
    printDrvRegisters(serial);
    serial.println();
    g_last_hall_state = hall;
  }
}

void updateSimpleFocOpenloopDebug(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver3.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_openloop_debug_started = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver3.enable();
      g_motor.enable();
      g_openloop_debug_started = true;
      g_openloop_debug_step_ms = now;
      g_openloop_debug_angle_el = 0.0f;
      g_openloop_debug_voltage = config::kSimpleFocOpenloopDebugVoltage;
      g_last_hall_state = hall;
      if (drvReadyForPwm()) {
        g_motor.setPhaseVoltage(g_openloop_debug_voltage, 0.0f, g_openloop_debug_angle_el);
      }
    }
    printState(serial, g_openloop_debug_started ? "enable_applied" : "enable_failed");
  }

  if (g_openloop_debug_started && (now - g_openloop_debug_step_ms) >= config::kSimpleFocOpenloopDebugStepMs) {
    g_openloop_debug_step_ms = now;
    advanceOpenloopAngleStep();
    if (drvReadyForPwm()) {
      g_motor.setPhaseVoltage(g_openloop_debug_voltage, 0.0f, g_openloop_debug_angle_el);
    } else {
      pwmOff();
    }
    printState(serial, "angle_step");
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    g_last_print_ms = now;
    if (g_driver_enabled && config::kSimpleFocClosedloopPeriodicSpiRead) {
      (void)drvReadAll();
    }
    if (config::kSimpleFocClosedloopPeriodicLog) {
      printState(serial, "periodic");
    }
  }

  if (config::kSimpleFocLogHallChanges && g_driver_enabled && hall != g_last_hall_state) {
    serial.print("motor_test reason=hall_change prev=");
    printHallBits(serial, g_last_hall_state);
    serial.print(" next=");
    printHallBits(serial, hall);
    serial.print(" prev_idx=");
    serial.print(hallIndex(g_last_hall_state));
    serial.print(" next_idx=");
    serial.print(hallIndex(hall));
    serial.print(" valid=");
    serial.print(isValidHallState(hall) ? "yes" : "no");
    serial.print(" angle_el=");
    serial.print(g_openloop_debug_angle_el, 3);
    printDrvRegisters(serial);
    serial.println();
    g_last_hall_state = hall;
  }
}

void updateSimpleFocClosedloop(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();
  const float target_sign = config::kSimpleFocClosedloopReverse ? -1.0f : 1.0f;
  const float closed_target_rad_s = closedloopTargetRadS();
  const float raw_sensor_rad_s = closedloopRawSensorRadS();
  g_closedloop_loopfoc_called = false;
  g_closedloop_move_called = false;

  if (g_closedloop_safety_stop_latched) {
    if (g_driver_enabled) {
      g_motor.disable();
      g_driver6.disable();
      drvDisable();
    }
    return;
  }

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver3.disable();
      pwmOff();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_closedloop_started = false;
      g_closedloop_startup_active = false;
      g_closedloop_initfoc_done = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver3.enable();
      g_motor.enable();
      g_closedloop_enable_ms = now;
      g_closedloop_last_hall_transition_ms = now;
      g_last_hall_state = hall;
      g_closedloop_last_hall_idx = hallIndex(hall);
      g_closedloop_hall_delta = 0;
      g_closedloop_initfoc_started = true;
      if (drvReadyForPwm()) {
        printState(serial, "initFOC_start");
        g_motor.initFOC();
        g_closedloop_initfoc_done = true;
        printState(serial, "initFOC_done");
        if (drvReadyForPwm()) {
          g_closedloop_started = true;
          if (config::kSimpleFocClosedloopUseStartupAssist) {
            startClosedloopStartupPhase(now, closed_target_rad_s, false);
          } else {
            g_closedloop_startup_active = false;
            g_closedloop_recovery_active = false;
            g_motor.controller = MotionControlType::velocity;
            g_closedloop_last_hall_transition_ms = now;
          }
        } else {
          pwmOff();
          g_closedloop_started = false;
        }
      } else {
        pwmOff();
        g_closedloop_started = false;
      }
    }
    printState(serial, g_closedloop_started ? "enable_applied" : "enable_failed");
  }

  if (!g_closedloop_started) {
    if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
      g_last_print_ms = now;
      if (g_driver_enabled && config::kSimpleFocClosedloopPeriodicSpiRead) {
        (void)drvReadAll();
      }
      if (config::kSimpleFocClosedloopPeriodicLog) {
        printState(serial, "periodic");
      }
    }
    return;
  }

  if (!g_drv_configured || !g_drv.control_match || g_drv.frame_fault || faultActive()) {
    pwmOff();
    if (g_driver_enabled) {
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
    }
    g_closedloop_started = false;
    g_closedloop_startup_active = false;
    return;
  }

  if (hall != g_last_hall_state) {
    recordClosedloopHallTransition(g_last_hall_state, hall);
    g_last_hall_state = hall;
  }
  updateClosedloopStallTracking(hall, closed_target_rad_s, closedloopMeasuredRadS(), raw_sensor_rad_s);

  if (!g_closedloop_startup_active) {
    if (g_closedloop_stall_detected && g_closedloop_raw_zero_detected) {
      if (g_closedloop_stall_since_ms == 0u) {
        g_closedloop_stall_since_ms = now;
      } else if ((now - g_closedloop_stall_since_ms) >=
                 config::kSimpleFocClosedloopStallDebounceMs) {
        g_closedloop_stall_since_ms = 0u;
        if (config::kSimpleFocClosedloopUseStartupAssist) {
          ++g_closedloop_recovery_count;
          startClosedloopStartupPhase(now, closed_target_rad_s, true);
          printState(serial, "stall_recovery_start");
        } else {
          g_motor.disable();
          g_driver6.disable();
          printState(serial, "stall_stop");
          drvDisable();
          g_closedloop_started = false;
          return;
        }
      }
    } else {
      g_closedloop_stall_since_ms = 0u;
    }
  } else {
    g_closedloop_stall_since_ms = 0u;
  }

  if (g_closedloop_startup_active) {
    const uint32_t elapsed_ms = now - g_closedloop_startup_phase_ms;
    const float measured_rad_s = closedloopMeasuredRadS();
    const uint32_t phase_limit_ms = g_closedloop_recovery_active
                                        ? config::kSimpleFocClosedloopRecoveryMs
                                        : config::kSimpleFocClosedloopStartupMs;
    if (elapsed_ms >= phase_limit_ms) {
      const bool prev_handoff_allowed = g_closedloop_handoff_allowed;
      g_closedloop_measured_rad_s_at_handoff = measured_rad_s;
      g_closedloop_handoff_allowed =
          closedloopHandoffReady(closed_target_rad_s, measured_rad_s, raw_sensor_rad_s);
      const bool should_log_handoff =
          !g_closedloop_handoff_evaluated || prev_handoff_allowed != g_closedloop_handoff_allowed;
      g_closedloop_handoff_evaluated = true;
      if (g_closedloop_handoff_allowed) {
        g_closedloop_startup_active = false;
        g_closedloop_recovery_active = false;
        g_motor.controller = MotionControlType::velocity;
      }
      if (should_log_handoff) {
        printState(serial, "startup_handoff");
      }
    }

    if (g_closedloop_startup_active) {
      float startup_target_rad_s = g_closedloop_startup_target_rad_s;
      const float startup_limit = fabsf(closed_target_rad_s) * 1.5f;
      if (fabsf(measured_rad_s) > startup_limit) {
        startup_target_rad_s *= 0.5f;
      }
      g_motor.move(startup_target_rad_s);
      g_closedloop_move_called = true;
    }
  }

  if (!g_closedloop_startup_active) {
    if (!drvReadyForPwm()) {
      pwmOff();
      return;
    }
    g_motor.loopFOC();
    g_closedloop_loopfoc_called = true;
    g_motor.move(closed_target_rad_s);
    g_closedloop_move_called = true;
  }

  if (!drvReadyForPwm()) {
    pwmOff();
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    noInterrupts();
    const uint32_t irq_a = hall_a_irq_count;
    const uint32_t irq_b = hall_b_irq_count;
    const uint32_t irq_c = hall_c_irq_count;
    interrupts();
    const float sensor_angle = g_hall_sensor.getAngle();
    const float sensor_velocity = g_hall_sensor.getVelocity();
    g_hall_a_irq_delta = irq_a - g_last_hall_a_irq_count;
    g_hall_b_irq_delta = irq_b - g_last_hall_b_irq_count;
    g_hall_c_irq_delta = irq_c - g_last_hall_c_irq_count;
    g_hall_irq_counts_increasing =
        (g_hall_a_irq_delta > 0u) || (g_hall_b_irq_delta > 0u) || (g_hall_c_irq_delta > 0u);
    g_sensor_angle_changes = fabsf(sensor_angle - g_last_sensor_angle) > 0.0001f;
    g_sensor_velocity_valid = isfinite(sensor_velocity) && fabsf(sensor_velocity) > 0.001f;
    g_last_hall_a_irq_count = irq_a;
    g_last_hall_b_irq_count = irq_b;
    g_last_hall_c_irq_count = irq_c;
    g_last_sensor_angle = sensor_angle;
    g_last_sensor_velocity = sensor_velocity;
    g_last_print_ms = now;
    if (g_driver_enabled && config::kSimpleFocClosedloopPeriodicSpiRead) {
      (void)drvReadAll();
    }
    if (config::kSimpleFocClosedloopPeriodicLog) {
      printState(serial, "periodic");
    }
    g_closedloop_hall_forward_count = 0;
    g_closedloop_hall_reverse_count = 0;
    g_closedloop_hall_jump_count = 0;
    g_closedloop_hall_invalid_count = 0;
  }
}

