feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
void updateSimpleFocClosedloop6Pwm(Stream& serial) {
  const uint32_t now = millis();
  const bool fault_active = faultActive();
  const uint8_t hall = readHallState();
  const float target_sign = config::kSimpleFocClosedloopReverse ? -1.0f : 1.0f;
  const float closed_target_rad_s = closedloopTargetRadS();
  const float raw_sensor_rad_s = closedloopRawSensorRadS();
  g_closedloop_loopfoc_called = false;
  g_closedloop_move_called = false;

  if (g_closedloop_safety_stop_latched) {
    if (g_driver_enabled) {
      g_motor.disable();
      g_driver6.disable();
      drvDisable();
    }
    return;
  }

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      g_motor.disable();
      g_driver6.disable();
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_closedloop_started = false;
      g_closedloop_startup_active = false;
      g_closedloop_initfoc_done = false;
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSimpleFocEnableDelayMs) {
    if (drvEnableAndConfigure(serial)) {
      g_driver6.enable();
      g_motor.enable();
      g_closedloop_enable_ms = now;
      g_closedloop_last_hall_transition_ms = now;
      g_last_hall_state = hall;
      g_closedloop_last_hall_idx = hallIndex(hall);
      g_closedloop_hall_delta = 0;
      g_closedloop_initfoc_started = true;
      if (drvReadyForPwm()) {
        printState(serial, "initFOC_start");
        g_motor.initFOC();
        g_closedloop_initfoc_done = true;
        printState(serial, "initFOC_done");
        if (drvReadyForPwm()) {
          g_closedloop_started = true;
          if (config::kSimpleFocClosedloopUseStartupAssist) {
            startClosedloopStartupPhase(now, closed_target_rad_s, false);
          } else {
            g_closedloop_startup_active = false;
            g_closedloop_recovery_active = false;
            g_motor.controller = MotionControlType::velocity;
            g_closedloop_last_hall_transition_ms = now;
          }
        } else {
          g_driver6.disable();
          g_closedloop_started = false;
        }
      } else {
        g_driver6.disable();
        g_closedloop_started = false;
      }
    }
    printState(serial, g_closedloop_started ? "enable_applied" : "enable_failed");
  }

  if (!g_closedloop_started) {
    if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
      g_last_print_ms = now;
      if (g_driver_enabled && config::kSimpleFocClosedloopPeriodicSpiRead) {
        (void)drvReadAll();
      }
      if (config::kSimpleFocClosedloopPeriodicLog) {
        printState(serial, "periodic");
      }
    }
    return;
  }

  if (!g_drv_configured || !g_drv.control_match || g_drv.frame_fault || faultActive()) {
    g_driver6.disable();
    if (g_driver_enabled) {
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
    }
    g_closedloop_started = false;
    g_closedloop_startup_active = false;
    return;
  }

  if (hall != g_last_hall_state) {
    recordClosedloopHallTransition(g_last_hall_state, hall);
    g_last_hall_state = hall;
  }
  updateClosedloopStallTracking(hall, closed_target_rad_s, closedloopMeasuredRadS(), raw_sensor_rad_s);

  if (!g_closedloop_startup_active) {
    if (g_closedloop_stall_detected && g_closedloop_raw_zero_detected) {
      if (g_closedloop_stall_since_ms == 0u) {
        g_closedloop_stall_since_ms = now;
      } else if ((now - g_closedloop_stall_since_ms) >=
                 config::kSimpleFocClosedloopStallDebounceMs) {
        g_closedloop_stall_since_ms = 0u;
        g_motor.disable();
        g_driver6.disable();
        g_closedloop_safety_stop_latched = true;
        printState(serial, "stall_stop");
        drvDisable();
        g_closedloop_started = false;
        return;
      }
    } else {
      g_closedloop_stall_since_ms = 0u;
    }
  } else {
    g_closedloop_stall_since_ms = 0u;
  }

  if (g_closedloop_startup_active) {
    const uint32_t elapsed_ms = now - g_closedloop_startup_phase_ms;
    const float measured_rad_s = closedloopMeasuredRadS();
    const uint32_t phase_limit_ms = g_closedloop_recovery_active
                                        ? config::kSimpleFocClosedloopRecoveryMs
                                        : config::kSimpleFocClosedloopStartupMs;
    if (elapsed_ms >= phase_limit_ms) {
      const bool prev_handoff_allowed = g_closedloop_handoff_allowed;
      g_closedloop_measured_rad_s_at_handoff = measured_rad_s;
      g_closedloop_handoff_allowed =
          closedloopHandoffReady(closed_target_rad_s, measured_rad_s, raw_sensor_rad_s);
      const bool should_log_handoff =
          !g_closedloop_handoff_evaluated || prev_handoff_allowed != g_closedloop_handoff_allowed;
      g_closedloop_handoff_evaluated = true;
      if (g_closedloop_handoff_allowed) {
        g_closedloop_startup_active = false;
        g_closedloop_recovery_active = false;
        g_motor.controller = MotionControlType::velocity;
        g_motor.voltage_limit = config::kSimpleFocClosedloopVoltageLimit;
        g_closedloop_last_hall_transition_ms = now;
      } else {
        g_motor.disable();
        g_driver6.disable();
        g_closedloop_safety_stop_latched = true;
        printState(serial, "startup_handoff_failed");
        drvDisable();
        g_closedloop_started = false;
        g_closedloop_startup_active = false;
        return;
      }
      if (should_log_handoff) {
        printState(serial, "startup_handoff");
      }
    }

    if (g_closedloop_startup_active) {
      float startup_target_rad_s = g_closedloop_startup_target_rad_s;
      const float startup_limit = fabsf(closed_target_rad_s) * 1.5f;
      if (fabsf(measured_rad_s) > startup_limit) {
        startup_target_rad_s *= 0.5f;
      }
      g_motor.voltage_limit = config::kSimpleFocClosedloopStartupVoltageLimit;
      g_motor.move(startup_target_rad_s);
      g_closedloop_move_called = true;
    }
  }

  if (!g_closedloop_startup_active) {
    if (!drvReadyForPwm()) {
      g_driver6.disable();
      return;
    }
    g_motor.voltage_limit = config::kSimpleFocClosedloopVoltageLimit;
    g_motor.loopFOC();
    g_closedloop_loopfoc_called = true;
    g_motor.move(closed_target_rad_s);
    g_closedloop_move_called = true;
  }

  if (!drvReadyForPwm()) {
    g_driver6.disable();
  }

  if (closedloopHallWatchdogExpired(now)) {
    g_closedloop_hall_watchdog_tripped = true;
    g_motor.disable();
    g_driver6.disable();
    g_closedloop_safety_stop_latched = true;
    printState(serial, "hall_watchdog_stop");
    drvDisable();
    g_closedloop_started = false;
    g_closedloop_startup_active = false;
    return;
  }

  if ((now - g_last_print_ms) >= config::kSimpleFocStatusIntervalMs) {
    noInterrupts();
    const uint32_t irq_a = hall_a_irq_count;
    const uint32_t irq_b = hall_b_irq_count;
    const uint32_t irq_c = hall_c_irq_count;
    interrupts();
    const float sensor_angle = g_hall_sensor.getAngle();
    const float sensor_velocity = g_hall_sensor.getVelocity();
    g_hall_a_irq_delta = irq_a - g_last_hall_a_irq_count;
    g_hall_b_irq_delta = irq_b - g_last_hall_b_irq_count;
    g_hall_c_irq_delta = irq_c - g_last_hall_c_irq_count;
    g_hall_irq_counts_increasing =
        (g_hall_a_irq_delta > 0u) || (g_hall_b_irq_delta > 0u) || (g_hall_c_irq_delta > 0u);
    g_sensor_angle_changes = fabsf(sensor_angle - g_last_sensor_angle) > 0.0001f;
    g_sensor_velocity_valid = isfinite(sensor_velocity) && fabsf(sensor_velocity) > 0.001f;
    g_last_hall_a_irq_count = irq_a;
    g_last_hall_b_irq_count = irq_b;
    g_last_hall_c_irq_count = irq_c;
    g_last_sensor_angle = sensor_angle;
    g_last_sensor_velocity = sensor_velocity;
    g_last_print_ms = now;
    if (g_driver_enabled && config::kSimpleFocClosedloopPeriodicSpiRead) {
      (void)drvReadAll();
    }
    if (config::kSimpleFocClosedloopPeriodicLog) {
      printState(serial, "periodic");
    }
    g_closedloop_hall_forward_count = 0;
    g_closedloop_hall_reverse_count = 0;
    g_closedloop_hall_jump_count = 0;
    g_closedloop_hall_invalid_count = 0;
  }
}

void updateHallSensorCheck(Stream& serial) {
  const uint32_t now = millis();
  const uint8_t hall = readHallState();
  g_hall_sensor.update();

  if (hall != g_last_hall_state) {
    g_last_hall_state = hall;
    printState(serial, "hall_change");
  }

