feco9308/agopen-rate-can-ecu/firmware/STM32_nod/src/motor_test.cpp
  if ((now - g_last_print_ms) >= config::kHallSensorCheckStatusIntervalMs) {
    g_last_print_ms = now;
    printState(serial, "periodic");
  }
}

}  // namespace

void begin(Stream& serial) {
  if (config::kTestMode == config::TEST_HALL_SENSOR_CHECK) {
    beginHallSensorCheck(serial);
    return;
  }

  if (config::kTestMode == config::TEST_DRIVER_SPI_STABILITY) {
    beginDrvSpiStability(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP) {
    beginSimpleFocClosedloop(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP_6PWM) {
    beginSimpleFocClosedloop6Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP_DEBUG) {
    beginSimpleFocOpenloopDebug(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK) {
    beginPhaseCheck(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_6PWM) {
    beginPhaseCheck6Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_3PWM) {
    beginPhaseCheck3Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_RAW_C_PINS) {
    beginRawCPins(serial);
    return;
  }

  if (config::kTestMode == config::TEST_RAW_3PWM_PINS) {
    beginRaw3PwmPins(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP) {
    beginSimpleFocOpenloop(serial);
    return;
  }

  pinMode(config::kDrvEnablePin, OUTPUT);
  pinMode(config::kDrvFaultPin, INPUT_PULLUP);
  pinMode(config::kHallAPin, INPUT_PULLUP);
  pinMode(config::kHallBPin, INPUT_PULLUP);
  pinMode(config::kHallCPin, INPUT_PULLUP);
  pinMode(config::kPwmAPin, OUTPUT);
  pinMode(config::kPwmBPin, OUTPUT);
  pinMode(config::kPwmCPin, OUTPUT);
  drvDisable();

  g_fault_latched = false;
  g_driver_enabled = false;
  g_drv_configured = false;
  g_sixstep_startup_active = false;
  g_step_index = 0;
  g_last_hall_state = readHallState();
  g_boot_ms = millis();
  g_last_print_ms = 0;
  g_sixstep_enable_ms = 0;
  g_sixstep_last_kick_ms = 0;
  g_sixstep_current_duty = config::kSixStepPwmDuty;
  g_drv = {};

  const bool spi_ok = drvSpiInit();
  if (spi_ok) {
    (void)drvReadAll();
  }

  serial.println("6-step hall commutation test");
  serial.println("Driver starts disabled and outputs are zero.");
  serial.print("Enable delay ms=");
  serial.print(config::kSixStepEnableDelayMs);
  serial.print(" pwm duty=");
  serial.print(config::kSixStepPwmDuty);
  serial.print(" startup duty=");
  serial.print(config::kSixStepStartupPwmDuty);
  serial.print(" startup step ms=");
  serial.print(config::kSixStepStartupStepMs);
  serial.print(" startup kick ms=");
  serial.print(config::kSixStepStartupKickMs);
  serial.print(" hall advance=");
  serial.print(config::kSixStepHallAdvance);
  serial.print(" reverse=");
  serial.println(config::kSixStepReverseDirection ? "yes" : "no");
  serial.print("SPI init=");
  serial.println(spi_ok ? "ok" : "failed");
  serial.println("Keep motor unloaded. Stop immediately on harsh vibration.");
  printState(serial, "boot");
}

void update(Stream& serial) {
  if (config::kTestMode == config::TEST_HALL_SENSOR_CHECK) {
    updateHallSensorCheck(serial);
    return;
  }

  if (config::kTestMode == config::TEST_DRIVER_SPI_STABILITY) {
    updateDrvSpiStability(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP) {
    updateSimpleFocClosedloop(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_CLOSEDLOOP_6PWM) {
    updateSimpleFocClosedloop6Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK) {
    updatePhaseCheck(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_6PWM) {
    updatePhaseCheck6Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_PHASE_CHECK_3PWM) {
    updatePhaseCheck3Pwm(serial);
    return;
  }

  if (config::kTestMode == config::TEST_RAW_C_PINS) {
    updateRawCPins(serial);
    return;
  }

  if (config::kTestMode == config::TEST_RAW_3PWM_PINS) {
    updateRaw3PwmPins(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP) {
    updateSimpleFocOpenloop(serial);
    return;
  }

  if (config::kTestMode == config::TEST_SIMPLEFOC_OPENLOOP_DEBUG) {
    updateSimpleFocOpenloopDebug(serial);
    return;
  }

  const uint32_t now = millis();
  const bool fault_active = faultActive();

  if (fault_active) {
    if (g_driver_enabled || !g_fault_latched) {
      (void)drvReadAll();
      printState(serial, "fault_before_disable");
      drvDisable();
      g_fault_latched = true;
    }
    return;
  }

  if (g_fault_latched) {
    g_fault_latched = false;
    (void)drvReadAll();
    printState(serial, "fault_cleared");
  }

  if (!g_driver_enabled && (now - g_boot_ms) >= config::kSixStepEnableDelayMs) {
    const bool drv_ok = drvEnableAndConfigure(serial);
    g_sixstep_enable_ms = now;
    g_sixstep_last_kick_ms = now;
    g_sixstep_startup_active = drv_ok;
    const bool commutation_ok = drv_ok && applyCommutationForHall(readHallState());
    if (commutation_ok) {
      applyStepIndexWithDuty(g_step_index, config::kSixStepStartupPwmDuty);
    }
    printState(serial, commutation_ok ? "enable_applied" : "enable_failed");
  }

  const uint8_t hall = readHallState();
  if (g_driver_enabled && hall != g_last_hall_state) {
    g_last_hall_state = hall;
    g_sixstep_startup_active = false;
    const bool commutation_ok = applyCommutationForHall(hall);
    printState(serial, commutation_ok ? "hall_update" : "invalid_hall");
  }

  if (g_driver_enabled && g_sixstep_startup_active) {
    if ((now - g_sixstep_enable_ms) >= config::kSixStepStartupKickMs) {
      g_sixstep_startup_active = false;
      (void)applyCommutationForHall(readHallState());
      printState(serial, "startup_complete");
    } else if ((now - g_sixstep_last_kick_ms) >= config::kSixStepStartupStepMs) {
      g_sixstep_last_kick_ms = now;
      applyStepIndexWithDuty(static_cast<uint8_t>(g_step_index + 1u), config::kSixStepStartupPwmDuty);
      printState(serial, "startup_kick");
    }
  }

  if ((now - g_last_print_ms) >= config::kSixStepStatusIntervalMs) {
    g_last_print_ms = now;
    if (g_driver_enabled) {
      (void)drvReadAll();
    }
    printState(serial, "periodic");
  }
}

bool driverEnabled() {
  return g_driver_enabled;
}

}  // namespace motor_test
